library(tidyverse)

files <- dir("db", full.names = TRUE)

raw <- tibble()

# readxl::read_xlsx(files[2],
#                   skip = 3) %>% 
#   filter(str_detect(`№`, "^\\d+")) %>% nrow()

for (file in files) {
  print(file)
  readxl::read_xlsx(file,
                    skip = 3) %>% 
    filter(str_detect(`№`, "^\\d+")) %>% 
    bind_rows(raw) -> raw
  print("done")
}

raw %>% colnames()

raw %>% 
  distinct(Наименование, `Регистрационный номер`) %>% nrow()

raw %>% 
  select(-1) %>% 
  distinct() %>% # nrow()
  summarise(n = n(),
            .by = c(Наименование, `Регистрационный номер`)) %>% 
  arrange(desc(n)) %>% 
  filter(n != 1)
  # distinct(Наименование, `Регистрационный номер`) %>% nrow()


raw %>% 
  # filter(`Регистрационный номер` == "1037789063476") %>% View()
  filter(`Регистрационный номер` == "1087746571065") %>% View()

raw$Статус %>% unique()


raw %>% 
  mutate(`ОКВЭД основной` = str_extract(`Коды всех видов деятельности`, "^\\d{2}\\.\\d+\\.\\d+|^\\d{2}\\.\\d+|^\\d{2}")) %>% 
  # select(`ОКВЭД основной`, `Коды всех видов деятельности`) #%>% # sapply(is.na) %>% apply(2, sum)
  # filter(is.na(`Код основного вида деятельности`))
  mutate(`ОКВЭДы дополнительные` = str_remove(`Коды всех видов деятельности`, "^\\d{2}\\.\\d+\\.\\d+\\s|^\\d{2}\\.\\d+\\s|^\\d{2}\\s") %>% 
           str_remove("\\(.+\\),\\s")) %>% 
  # select(`ОКВЭД основной`, `ОКВЭДы дополнительные`, `Коды всех видов деятельности`) %>% View()
  select(-`Коды всех видов деятельности`) %>% 
  filter(Статус == "Действующая") %>% 
  select(-1) %>% 
  # select(-matches("НДПИ")) %>% 
  distinct() %>% # nrow()
  summarise(n = n(),
            .by = c(Наименование, `Регистрационный номер`)) %>% 
  arrange(desc(n)) %>% 
  filter(n != 1) -> doubles

nrow(doubles)

colnames(raw)

raw %>% 
  mutate(nrow = 1:nrow(raw)) %>% 
  right_join(doubles) %>% 
  arrange(`Регистрационный номер`) %>% 
  write_excel_csv("doubles.xlsx")
  # select(nrow, Наименование, `Регистрационный номер`, matches("НДПИ")) %>% View()


## nrows delete ----
# nrows_del <- c(50256,
# 72520,
# 132504,
# 48842,
# 108321,
# 131029,
# 2717,
# 38804,
# 100375,
# 31285,
# 108055,
# 2141,
# 37065,
# 35215,
# 52322,
# 60982,
# 74551,
# 104035,
# 134477,
# 610,
# 31931,
# 154323,
# 31157,
# 48395,
# 70896,
# 139434,
# 1424,
# 34870,
# 118431,
# 143207,
# 33415,
# 59528,
# 86205,
# 98047,
# 55927,
# 93297,
# 96039,
# 100528,
# 106319,
# 115968,
# 148878,
# 119651,
# 136602,
# 37596,
# 76743,
# 963,
# 33240,
# 50581,
# 97960,
# 123589,
# 132757,
# 37414,
# 99742,
# 1143,
# 6841,
# 33943,
# 9967,
# 99757,
# 114186,
# 136258,
# 6955,
# 51369,
# 98373,
# 11431,
# 137594,
# 7679,
# 125193,
# 143208,
# 5492,
# 49877,
# 58751,
# 89318,
# 97621,
# 122904,
# 132167,
# 140824,
# 9921,
# 136163,
# 7723,
# 103896,
# 125242,
# 134256,
# 11868,
# 56158,
# 78379,
# 4634,
# 101927,
# 108557,
# 122048,
# 9825,
# 99695,
# 136087,
# 145451,
# 150389,
# 6329,
# 15705,
# 50754,
# 94674,
# 123755,
# 132916,
# 6101,
# 15490,
# 59335,
# 72762,
# 89681,
# 102862,
# 7516,
# 16837,
# 51923,
# 60591,
# 74110,
# 11457,
# 20550,
# 137617,
# 19275,
# 136392,
# 9715,
# 18961,
# 113915,
# 127270,
# 145361,
# 5586,
# 14925,
# 102519,
# 109547,
# 8047,
# 17347,
# 52421,
# 57807,
# 71023,
# 101628,
# 108090,
# 121620,
# 7225,
# 16596,
# 51646,
# 60289,
# 73767,
# 86434,
# 98516,
# 103566,
# 111254,
# 133818,
# 142680,
# 19743,
# 63337,
# 77163,
# 87454,
# 105686,
# 114846,
# 128134,
# 19167,
# 99738,
# 145634,
# 16844,
# 60599,
# 74117,
# 90619,
# 18772,
# 27366,
# 53820,
# 76070,
# 83235,
# 119288,
# 127032,
# 71805,
# 80417,
# 89124,
# 140471,
# 15680,
# 24489,
# 50723,
# 59527,
# 66679,
# 72954,
# 81165,
# 28586,
# 55153,
# 69065,
# 84111,
# 87518,
# 115126,
# 128400,
# 126955,
# 25964,
# 98864,
# 27703,
# 54230,
# 99729,
# 145589,
# 50440,
# 66510,
# 80962,
# 26696,
# 44496,
# 118940,
# 135225,
# 11236,
# 38793,
# 55558,
# 34983,
# 52129,
# 98752,
# 134303,
# 143314,
# 35236,
# 52334,
# 112032,
# 5181,
# 14505,
# 131794,
# 11960,
# 21020,
# 100684,
# 147768,
# 148565,
# 14198,
# 71660,
# 117394,
# 122353,
# 154265)

## ----


raw %>% 
  mutate(nrow = 1:nrow(raw)) %>% 
  slice(-nrows_del) %>% 
  select(-nrow) %>% 
  mutate(`ОКВЭД основной` = str_extract(`Коды всех видов деятельности`, "^\\d{2}\\.\\d+\\.\\d+|^\\d{2}\\.\\d+|^\\d{2}")) %>% 
  mutate(`ОКВЭДы дополнительные` = str_remove(`Коды всех видов деятельности`, "^\\d{2}\\.\\d+\\.\\d+\\s|^\\d{2}\\.\\d+\\s|^\\d{2}\\s") %>% 
           str_remove("\\(.+\\),\\s")) %>% 
  select(-`Коды всех видов деятельности`) %>% #nrow()
  filter(Статус == "Действующая") %>% # nrow()
  select(-1) %>% 
  distinct() -> db

db %>% write_excel_csv("database_merged.xlsx")

db %>% pull(`2023, Выручка, млн. RUB`) %>% `<`(100) %>% sum()

nrow(db)
db %>% pull(`2023, Налоги, млн. RUB`) %>% is.na() %>% sum()

db %>% pull(`2022, Налоги, млн. RUB`)
db %>% pull(`2022, Налог на прибыль, млн. RUB...144`) == db %>% pull(`2022, Налог на прибыль, млн. RUB...74`)
db %>% pull(`2023, Налог на прибыль, млн. RUB...75`)
db %>% pull(`2023, Налог на прибыль, млн. RUB...145`)

# db$`ОКВЭД основной`
db %>% 
  mutate(okved_main_group = str_extract(`ОКВЭД основной`, "^\\d{2}")) %>% 
  summarise(n = n(),
            .by = okved_main_group) %>% 
  arrange(desc(n)) %>% 
  ggplot(aes(okved_main_group, n)) +
  geom_col() +
  coord_flip()


db %>% 
  filter(!is.na(`2023, Налог на прибыль, млн. RUB...145`)) %>% 
  arrange(desc(`2023, Налог на прибыль, млн. RUB...145`)) %>% View()





